In [1]:
from SPARQLWrapper import SPARQLWrapper, JSON

In [2]:
import pandas as pd

In [3]:
import os
li = ["Queries/"+ x for x in os.listdir("Queries")]

In [26]:
def save_result(path):
    with open(path) as f:
        s = " ".join([x.strip() for x in f])     
        sparql = SPARQLWrapper("http://127.0.0.1:3030/test/sparql")
        sparql.setQuery(s)
        sparql.setReturnFormat(JSON)
        results = sparql.query().convert()
        columns = results['head']['vars']
        df = pd.DataFrame(columns= columns)
        for x in results['results']['bindings']:
            value_li = []
            for val in x.values():
                value_li.append(val['value'])
            df = df.append(pd.Series(value_li, index=columns), ignore_index=True)
        return df

In [16]:
counter = 0
for path in li:
    counter+=1
    save_result(path,counter)

1. Give a room number and list the name of people who live in it.

In [27]:
df = save_result(li[0])

In [20]:
with open(li[0]) as f:
    s = f.read()
print(s)

PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX com: <http://kndonto.org/Company#>
PREFIX std: <http://kndonto.org/Student/StudentInfo#>
PREFIX plc: <http://kndonto.org/Place#>
PREFIX dom: <http://kndonto.org/Domitory#>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX inds: <http://kndonto.org/Industry#>
PREFIX dst: <http://kndonto.org/Destination#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?firstname ?lastname ?Room
	WHERE { ?people std:LiveINRoom ?Room.
		    ?people foaf:firstName ?firstname.
		    ?people foaf:lastName ?lastname.
	        ?Room dom:RoomNo '11_303'}
	ORDER BY(?firstname)

In [29]:
df

  firstname  lastname                                Room
0    Alfred    PARKER  http://kndonto.org/Domitory#11_303
1    Edward    TURNER  http://kndonto.org/Domitory#11_303
2     Harry     REYES  http://kndonto.org/Domitory#11_303
3     Henry  PHILLIPS  http://kndonto.org/Domitory#11_303
4    Robert     EVANS  http://kndonto.org/Domitory#11_303
5    Willie      CRUZ  http://kndonto.org/Domitory#11_303

2. Give oneâ€™s name and find his/her room number.

In [30]:
with open(li[1]) as f:
    s = f.read()
print(s)

PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX com: <http://kndonto.org/Company#>
PREFIX std: <http://kndonto.org/Student/StudentInfo#>
PREFIX plc: <http://kndonto.org/Place#>
PREFIX dom: <http://kndonto.org/Domitory#>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX inds: <http://kndonto.org/Industry#>
PREFIX dst: <http://kndonto.org/Destination#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
SELECT ?firstname ?lastname ?salary ?City ?houseprice
           WHERE{
                  ?people foaf:firstName ?firstname .
                  ?people foaf:lastName ?lastname .
                  ?people std:EmployedBy ?company .
                ?company com:avg_monthly_salary ?salary.
                ?company plc:Location ?City.
                ?City plc:house_pricing ?houseprice .
                FILTER(?salary*3 > ?houseprice)
                }ORDER BY ASC (?salary)

In [32]:
save_result(li[1])

,firstname,lastname,salary,City,houseprice
0,Alfred,PARKER,5000,http://kndonto.org/Destination#XINJIANG,9251
1,Robert,EVANS,5000,http://kndonto.org/Destination#YUNNAN,13246
2,James,MITCHELL,5500,http://kndonto.org/Destination#HEBEI,9619
3,Eleanore,JACKSON,7500,http://kndonto.org/Destination#SHANDONG,21080
4,Gretchen,MARTIN,7500,http://kndonto.org/Destination#SHANDONG,21080
5,Selena,WALKER,7500,http://kndonto.org/Destination#SHANDONG,21080
6,Tom,MORALES,7500,http://kndonto.org/Destination#SHANDONG,21080
7,Ethelyn,PEREZ,7500,http://kndonto.org/Destination#SHANDONG,21080
8,Lee,ROGERS,7500,http://kndonto.org/Destination#SHANDONG,21080
9,Thomas,DIAZ,7500,http://kndonto.org/Destination#SHANDONG,21080